# binary - двоичная
# Принцип работы алгоритма из задания
# №31502
# 3(N) -> 11(num_2) -> if -> 11100 -> 28
#
# lst = []  # Создаем пустой список для ответов.
# for N in range(1,300):
#     num_2 = bin(N)[2:] # Перевод в двоинчую + срез.
#     if N % 2 == 0: # Если ЧЕТНОЕ
#         num_2 = '11' + num_2 + '11'
#     else: # ИНАЧЕ (НЕЧЕТНОЕ)
#         num_2 = '1' + num_2 + '00'
#     R = int(num_2,2) # Из двоичной в ДЕСЯТИЧНУЮ
#     if R > 95:
#         lst.append(R) # Добавляем в список подходящий ответ.
# print(min(lst),lst) # Минимальное значение списка.

# Укажите наименьшее число R, превышающее 95,
# которое может быть результатом работы данного алгоритма

# № 31351
# for N in range(1,200):
#     num_2 = bin(N)[2:]
#     if sum(map(int,num_2)) % 2 == 0: # Сумма цифр ЧЕТНАЯ
#         num_2 = '10' + num_2[2:] + '0' # два левых разряда заменяются на 10;
#     else:
#         num_2 = '11' + num_2[2:] + '1' # То же самое,
#         # но "заменяются" на другие знаки
#     R = int(num_2,2)
#     if R >= 16:
#         print(N,'--->',R)
#В ответе просто минимальное N.

# №20278.
# for N in range(1,300):
#     N_2 = bin(N)[2:]
#     if sum(map(int,N_2)) % 2 == 0:
#         N_2 = N_2 + '01'
#         N_2 = '101' + N_2[3:]
#     else:
#         N_2 = N_2 + '10'
#         N_2 = '111' + N_2[3:]
#     R = int(N_2,2)
#     if R < 385:
#         print(N,R)

#print('---------------------------------------------------')
#
# a = []
# for N in range(1,300):
#     n_2 = bin(N)[2:]
#     if N % 2 == 0:
#         n_2 = n_2 + bin(n_2.count('1'))[2:]
#     else:
#         n_2 = '1' + n_2 + '101'
#     R = int(n_2,2)
#     if N > 150: # ВЫВЕСТИ МАКС/МИН R
#         a.append(R)
# print(max(a))
# print(min(a))

# Алгоритм перевода десятичного числа в любую СС.

def N_to_three(N):
    s = '' # Сюда дописываем остатки
    while N > 0: # До каких пор мы его делим.
        s = str(N % 3) + s
        N = N // 3
    return s

# for N in range(1,300):
#     n_3 = N_to_three(N)
#     if N % 3 == 0: # Делится на 3, либо кратно 3
#         n_3 = '1' + n_3 + '02'
#     else:
#         n_3 = n_3 + N_to_three((N % 3) * 5)
#         # то остаток от деления на 3
#         # умножается на 5, переводится в троичную запись и
#         # дописывается в конец числа.
#     R = int(n_3,3)
#     if R >= 177:
#         print(N,R)

for N in range(1,300):
    n_3 = N_to_three(N)
    if N % 3 == 0: # Делится на 3, либо кратно 3
        n_3 = '1' + n_3 + '02'
    else:
        n_3 = n_3 + N_to_three(sum(map(int,n_3)) * 2)
    R = int(n_3,3)
    if R >= 177:
        print(N,R)

N_to_three()