# binary - двоичная
# Принцип работы алгоритма из задания
# №31502
# 3(N) -> 11(num_2) -> if -> 11100 -> 28
#
# lst = []  # Создаем пустой список для ответов.
# for N in range(1,300):
#     num_2 = bin(N)[2:] # Перевод в двоинчую + срез.
#     if N % 2 == 0: # Если ЧЕТНОЕ
#         num_2 = '11' + num_2 + '11'
#     else: # ИНАЧЕ (НЕЧЕТНОЕ)
#         num_2 = '1' + num_2 + '00'
#     R = int(num_2,2) # Из двоичной в ДЕСЯТИЧНУЮ
#     if R > 95:
#         lst.append(R) # Добавляем в список подходящий ответ.
# print(min(lst),lst) # Минимальное значение списка.

# Укажите наименьшее число R, превышающее 95,
# которое может быть результатом работы данного алгоритма

# № 31351
# for N in range(1,200):
#     num_2 = bin(N)[2:]
#     if sum(map(int,num_2)) % 2 == 0: # Сумма цифр ЧЕТНАЯ
#         num_2 = '10' + num_2[2:] + '0' # два левых разряда заменяются на 10;
#     else:
#         num_2 = '11' + num_2[2:] + '1' # То же самое,
#         # но "заменяются" на другие знаки
#     R = int(num_2,2)
#     if R >= 16:
#         print(N,'--->',R)
#В ответе просто минимальное N.

# №20278.
# for N in range(1,300):
#     N_2 = bin(N)[2:]
#     if sum(map(int,N_2)) % 2 == 0:
#         N_2 = N_2 + '01'
#         N_2 = '101' + N_2[3:]
#     else:
#         N_2 = N_2 + '10'
#         N_2 = '111' + N_2[3:]
#     R = int(N_2,2)
#     if R < 385:
#         print(N,R)

#print('---------------------------------------------------')




