"""
Ввод/Вывод, Переменные, Типы данных, Операторы, арифметика, условные операторы.
"""

"""
Вывод информации в консоль
"""
# print()
# print("Текст 1")
# print('Текст 2')
#
# print('Я "люблю" свою работу!')


"""
Задача: Квадрат со стороной 5см. Нужно посчитать площадь и периметр.
"""
# a = 5 #Длина стороны
# b = a ** 2
# c = a - 5
# d = b + a #30

# ploshad = a ** 2
# perimeter = a * 4
# print(ploshad, perimeter)
#
# print('Площадь:',ploshad)
# print('Периметр:',perimeter)


"""
Правила называния переменных:
1) Нельзя начинать с числа (Пример ошибки: 1x = 10)
2) Нельзя использовать символы кроме нижнего подчеркивания (_)
3) Никаких русских букв.
"""
x1 = 10
_x = 10


"""
Типы данных:
1) str - string - строка. Текстовый тип данных. " ", ''.
2) int - integer - целое число.
3) float - числа с плавающей точкой.
4) bool - булевые значения. True и False.
5) lst - list - список (массив)
"""
text = 'hello'
num1 = 100
num2 = 200.12
a = False
b = True

# lst = ['hello', 100, 20.43, True, [1,2,3]]
# print(lst)
# print(*lst)
#
# print(10 + 15)
# print(10 - 15)
# print(10 * 15)
# print(10 / 5)
# print(10 ** 15)


"""
Целочисленная арифметика:
// - целое деление. Деление нацело.
%  - остаток от деления.

КРАТНО ЛИ?
Есть целое число. Нужно проверить, делиться ли оно на 8.
"""
#from random import randint
#num2 = randint(1,1000)
#print(num2 % 8 == 0)


"""
Условные операторы (условия):
>   больше
<   меньше
==  равно
!=  не равно
>=  больше или равно
<=  меньше или равно
"""
# print(10 + 5)
# print(10 % 8 != 2)
# print(10 > 5) # Да
# print(10 < 5) # Нет
print("-------------------")


"""
Проверка числа: Четное | Нечетное
if - если условие верно, иначе - else.
"""
# number = 101
# if number % 2 == 0:
#     print("Число четное!")
# else:
#     print("Число нечетное!")


"""
Проверка знака числа (конструкция if-elif-else и сравнение с независимыми if)
"""
# number2 = 0
# if number2 > 0:
#     print("Положительное")
# elif number2 == 0:
#     print('Число - ноль!')
# else:
#     print("Отрицательное")

# number2 = 0
# if number2 > 0:
#     print("Положительное")
# if number2 == 0:
#     print('Число - ноль!')
# if number2 < 0:
#     print("Отрицательное")


"""
Конструкция множественного выбора дня
"""
# day = int(input())
# if day == 1:
#     print('1 января крутой день')
# elif day == 2:
#     print('2 января крутой день')
# elif day == 3:
#     print('3 января крутой день')
# elif day == 4:
#     print('4 января крутой день')
# elif day == 5:
#     print('5 января крутой день')


"""
Составные условия.
Пользователь вводит число, если оно трехзначное и нечетное, то круто!
Логические связки:
и - and
или - or
не - not
импликация - <=
равнозначность ==
"""
# num = int(input())
# if num > 99:
#     if num < 1000:
#         if num % 2 == 1:
#             print('Число подходит!')

# if (num > 99 and num < 1000) and num % 2 == 1:
#     print('Число подходит!')
# else:
#     print('Не подходит!')


"""
Пользователь вводит число, если оно трехзначное ИЛИ нечетное, то круто!
not(num % 2 == 0) = должно быть нечетным
"""
# if (num > 99 and num < 1000) or num % 2 == 1:
#     print('Число подходит!')


"""
Циклы

ЦИКЛ WHILE (1) — ПОКА условие правдиво
Пример: От 5 до 0.
"""
# x = 5
# while x > 0:
#     print(x,'!')
#     x = x - 1


"""
Пример: От 0 до 10. И на 10 нам нужно написать ЗАПУСК!
x = x + 1 — КЛЮЧЕВАЯ СТРОЧКА!
"""
# x = 0
# while x < 11:
#     if x == 10:
#         print('Запуск')
#     else:
#         print(x)
#     x = x + 1


"""
Пример: Нам нужно авторизоваться в систему Windows. 
Что если пароль неправильный?
"""
# password = 'python'
# text = input('Введите пароль: ')
# while text != password:
#     print('Пароль неверный! Доступ заблокирован!')
#     text = input('Введите еще раз пароль: ')
# print('Доступ разрешен!')


"""
ЦИКЛ FOR (2) — используется для перебора элементов списка/последовательности.
Переменная цикла приходит за элементом в список.
"""
# colors = ['красный',"синий","черный"]
# for color in colors:
#     print("Мой любимый цвет это -",color)


"""
Примеры: 1) От 1 до 5 хочу вывести их квадраты. 
        2) Посимвольный перебор строки.
"""
# for num in 1,2,3,4,5:
#     print(num ** 2)
#
# for i in 'СТРОКА':
#     print(i)


"""
# 4 
"""
# numbers = [10,11,12,13,14,15,16,17,18,19,20]
# for num in numbers:
#     print(num**3)

# x = 0
# while x < 5:
#     print('ВЫВОЖУ ЭТОТ ТЕКСТ МНОГО РАЗ!')
#     x = x + 1
# print("Цикл завершен")

# Передать сюда список из 7 элементов.
# [1,1,1,1,1,1,1], 'элемент'
# for i in [1,1,1,1,1,1,1]:
#     print('Я люблю Python!')

# Как контролировать количество итераций?

# Функция range() - генерирует последовательность чисел!
#for i in range(5): #[0,1,2,3,4]
#    print(i)
#for i in range(1,5): #[1,2,3,4]
#    print(i)
# for i in range(1,11,3):# [1,4,7,10]
#     print(i)
# for i in range(5,0,-1):
#     print(i)

# Нужно вывести 100_000 чисел
# for i in range(0,100_000):
#     print(i)
#1) Генерируем последовательность чисел.
#2) Контролируем количество итераций.


"""
Задание №1
Условие: Представьте, что вы контролер в автобусе. 
Вам нужно проверить билеты только у пассажиров на 
четных местах в диапазоне от 2 до 1000 включительно. 
Напишите цикл, который выведет: "Проверяю место № 2", 
"Проверяю место № 4" и так далее до 1000.
"""

# for i in range(2,1001,2):
#     print('Проверяю место №:',i)
#
# for i in range(2,1001):
#     if i % 2 == 0:
#         print('Проверяю место №:',i)

"""
Условие: Каждое утро вы откладываете в копилку сумму, равную текущему дню месяца. 
1-го числа — 1 рубль, 2-го — 2 рубля, и так далее до 30-го числа. Напишите программу, 
которая с помощью range() посчитает, сколько денег будет в копилке в конце 30-дневного месяца
"""
# copilka = 0
# for i in range(1,31):
#     copilka = copilka + i
# print(copilka)

"""
Функции - именованый блок кода, который можно использовать многократно, 
причем в разных частях программы.
"""
# Функция которая будет приветствовать пользователя
def greetings():
    # Тело функции
    print('Приветствую тебя путник')
    print('Добро пожаловать на урок по Питону!')
# greetings()
#def proiz3(num1,num2,num3):
    #print(num1*num2*num3)

#proiz3(12030123,1231231,1412412)

"""
Оператор return (Выходные данные)
"""
def proiz3(num1,num2,num3):
    return num1*num2*num3
print(proiz3(12030123,1231231,1412412))
a = proiz3(12030123,1231231,1412412)
print("Результат работы функции: ",a)
# Было - 20920449330908178156
# Стало - пока в ретурне. Нужно вытащить.

def add_print(a,b):
    print(a + b)
def add_return(a,b):
    return a + b
add_print(1,10)
c = add_return(1,10)
print(c)

"""
Напишите функцию access_password(password), которая проверяет секретный пароль.
Если пароль "python" - то всё супер и ретурн должен вернуть "Доступ разрешен!", 
если нет, то "Неверный вход"!
"""
def access_password(password):
    if password == "python":
        return "Доступ разрешен!"
    else:
        return "Не разрешен!"
print(access_password('python'))

