# Теория по заданию:
# Алгебра-логики - математика высказываний.

# Истина - 1
# Ложь - 0

# Логические операции
# Отрицание(инверсия, НЕ) - not
# not(1) -> 0
# not(0) -> 1

# Конъюнкция(Логические И, логическое умножение, ∧) - and
# Истинна только тогда, когда оба операнда истинны (1 and 1)

# Дизъюнкции(Логическое ИЛИ, логическое сложение, ∨) - or
# Ложно только тогда, когда оба операнда ложны (0 or 0)

# Импликация(следование, ЕСЛИ - ТО "->") - <=   .
# A -> B = not(A) or B = A <= B

# Эквивалентность(равнозначность) - ==.
# Истинна, только когда значения операндов совпадают
# 1 == 1 = 1(истина)
# 0 == 0 = 1(истина)

# Приоритет выполнения лог.операций:
#0) Любая операция в скобках
#1) Отрицание - not
#2) Конъюнкция - and
#3) Дизъюнкция - or
#4) Импликация и равнознаность

# № 31499
# F=((x≡¬y)→¬(w→x))∨¬z
print('x y w z')
for x in 0,1:
    for y in 0,1:
        for w in 0,1:
            for z in 0,1:
                F = ((x == (not y)) <= (not(w<=x))) or (not z)
                if F == 0:
                    print(x, y, w, z)
print('------------------')
# № 29953
# F= ¬((x→w)→(w≡z)) ∧ y
print('x y w z')
for x in range(2):
    for y in range(2):
        for w in range(2):
            for z in range(2):
                F = not((x <= w) <= (w == z)) and y
                if F == 1:
                    print(x,y,w,z)
print('-----------------------------------')
#№ 29334
# F=((z→x)→(x≡y))∨¬w
print('x y w z')
for x in range(2):
    for y in range(2):
        for w in range(2):
            for z in range(2):
                F = ((z <=x) <= (x == y )) or (not w)
                if F == 0:
                    print(x,y,w,z)
print('-----------------------------------')
# Домашка
# Сайт: https://kompege.ru/task
# № 28750, 25341, 27614


print('x y w z')
for x in range(2):
    for y in range(2):
        for w in range(2):
            for z in range(2):
                F = ((x == z) <= ((not y) or w)) == (not((w<=z) or (x<=y)))
                if F == 1:
                    print(x,y,w,z)







